[
  {
    "title": "Testingfly API Testing Framework",
    "description": "This Java-based API testing framework is designed to streamline the process of testing APIs while leveraging the power of Excel as a data source. With a focus on simplicity and efficiency, this framework is data-driven, making it easy to set up and run tests quickly.",
    "link": {
      "href": "https://github.com/testingfly/testingfly-test-framework/blob/master/README.md",
      "label": "API Testing Framework"
    },
    "logo": {
      "src": "testingfly-api-test.png",
      "alt": "Test"
    }
  },
  {
    "title": "Playwright Boilerplate code with Angular, Jest and Allure Reporting",
    "description": "This is a Playwright boilerplate codebase that includes Angular, Jest, and Allure Reporting, making it easy to set up and execute end-to-end tests for your Angular applications. With Playwright's automation capabilities, Jest's testing framework, and Allure Reporting's detailed and visually appealing reports, you can efficiently test your Angular application.",
    "link": {
      "href": "https://github.com/testingfly/playwright-boilerplate-angular-jest-allure#readme",
      "label": "Playwright Boilerplate with Angular, Jest and Allure"
    },
    "logo": {
      "src": "playwright.png",
      "alt": "Playwright Testing Framework"
    }
  },
  {
    "title": "Project Metrics Dashboard",
    "description": "Create an insightful metrics dashboard using the Python Dash framework to display Jira metrics, offering an overview of project health, performance, and more. This versatile tool can be applied to any project utilizing Jira for enhanced project management and decision-making.",
    "link": {
      "href": "https://github.com/testingfly/testingfly-test-framework/blob/master/README.md",
      "label": "Python Dash Metrics"
    },
    "logo": {
      "src": "dash.png",
      "alt": "Test"
    }
  },
  {
    "title": "Angular DotNet Core Playwright Boilerplate",
    "description": "The Angular DotNet Core Playwright Boilerplate is a starting template for web application development. It combines Angular for the front-end, .NET Core for the back-end, and Playwright for end-to-end testing.",
    "link": {
      "href": "https://github.com/testingfly/angular-dotnetcore#readme",
      "label": "Angular DotNet"
    },
    "logo": {
      "src": "projects/angular_dotnet.jpeg",
      "alt": "Anuglar DotNet"
    }
  }

]
